tap "1password/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "deno"
brew "diff-so-fancy"
brew "dotnet", link: false
brew "duckdb"
brew "e2fsprogs"
brew "eza"
brew "freetds"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "iperf3"
brew "jq"
brew "lazygit"
brew "lrzsz"
brew "mise"
brew "neovim"
brew "nvm"
brew "ripgrep"
brew "opencode"
brew "openjdk"
brew "openssl@1.1"
brew "opentofu"
brew "pnpm"
brew "pyenv"
brew "shellcheck"
brew "starship"
brew "stow"
brew "telnet"
brew "terragrunt"
brew "tmux"
brew "wireguard-tools"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "antigravity"
cask "appcleaner"
cask "bruno"
cask "claude-code"
cask "desktoppr"
cask "docker-desktop"
cask "doll"
cask "dotnet-runtime"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "grammarly-desktop"
cask "hyperkey"
cask "raycast"
cask "stats"
cask "swiftbar"
