tap "1password/tap"
tap "4ier/tap"
tap "anomalyco/tap", trusted: true
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "hashicorp/tap"
tap "manaflow-ai/cmux"
tap "modem-dev/tap", trusted: { formulae: ["hunk"] }
tap "nikitabobko/tap"
tap "oven-sh/bun"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Tool for managing dock items
brew "dockutil"
# .NET Core
brew "dotnet", link: false
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Log analysis TUI
brew "gonzo"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Find what models run on your hardware
brew "llmfit"
# Next-gen compiler infrastructure
brew "llvm@15", link: true
# Tools for zmodem/xmodem/ymodem file transfer
brew "lrzsz"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama", link: false
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# General purpose fuzzy finder TUI
brew "television"
# User interface to the TELNET protocol
brew "telnet"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Agent orchestration platform
cask "antigravity"
# Application uninstaller
cask "appcleaner"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# Terminal-based AI coding assistant
cask "claude-code"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Server and cloud storage browser
cask "cyberduck"
# Command-line tool to set the desktop picture
cask "desktoppr"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Utility to show apps badges from the dock in the menu bar
cask "doll"
# Developer platform
cask "dotnet-runtime"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Grammarly for desktop
cask "grammarly-desktop"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Menu bar customization tool
cask "swiftbar"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Gecko based web browser
cask "zen"
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anjali.clipboard-history"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bastienboutonnet.vscode-dbt"
vscode "be5invis.vscode-custom-css"
vscode "boto3typed.boto3-ide"
vscode "bruno-api-client.bruno"
vscode "codium.codium"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "dvirtz.parquet-viewer"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "minodisk.bigquery-runner"
vscode "ml.nc-gcode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "orta.vscode-jest"
vscode "patricknasralla.tokyo-night-moon"
vscode "qinjia.seti-icons"
vscode "redhat.vscode-yaml"
vscode "rvest.vs-code-prettier-eslint"
vscode "samuelcolvin.jinjahtml"
vscode "tamasfe.even-better-toml"
vscode "vue.volar"
vscode "zhuangtongfa.material-theme"
npm "excalidraw-cli"
