4ops.terraform
alefragnani.project-manager
altimateai.vscode-altimate-mcp-server
anjali.clipboard-history
asvetliakov.vscode-neovim
bastienboutonnet.vscode-dbt
be5invis.vscode-custom-css
bierner.markdown-mermaid
boto3typed.boto3-ide
bruno-api-client.bruno
dbaeumer.vscode-eslint
denoland.vscode-deno
docker.docker
dracula-theme.theme-dracula
dvirtz.parquet-viewer
esbenp.prettier-vscode
github.vscode-github-actions
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hashicorp.terraform
hbenl.vscode-test-explorer
minodisk.bigquery-runner
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-python-envs
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
orta.vscode-jest
patricknasralla.tokyo-night-moon
qinjia.seti-icons
redhat.vscode-yaml
rvest.vs-code-prettier-eslint
samuelcolvin.jinjahtml
tamasfe.even-better-toml
tobias-z.vscode-harpoon
vue.volar
zhuangtongfa.material-theme
